Revit 2027 API
BendingDetailSegmentLengthsDisplayOptions Enumeration
 Describes if the segment lengths are represented using dimensions or just as text.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailSegmentLengthsDisplayOptions
Public Enumeration BendingDetailSegmentLengthsDisplayOptions
public enum class BendingDetailSegmentLengthsDisplayOptions
type BendingDetailSegmentLengthsDisplayOptions
Members
Member name | Value | Description
Dimension | 1 |  Display as dimensions
Text | 0 |  Display as texts
See Also
Reference
Autodesk.Revit.DB.Structure Namespace